<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Inserting and Updating Data with SQL

## 1.1 Let's first connect to our Database

In [2]:
# We will first load the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed. 
%sql sqlite://

'Connected: @None'

## 1.2 Importing Data From CSV Files

In [3]:
# In order to read any csv file, we will need to import our python csv library
# This will allow us to read a csv file that we will have uploaded to our evironment
import csv

In [4]:
# We will also need a pandas library which is used for data manipulation in this notebook. For now, don't worry too much about how it functions, we will explore it in details in the coming weeks.
import pandas as pd

Then we will download our csv files from 
*   [Interpol Dataset](http://bit.ly/DSInterpol) 
*   [Startups Dataset](http://bit.ly/DSStartup)
*   [Transactions Dataset](http://bit.ly/DSTransactions)
*   [Glass Dataset](http://bit.ly/DSGlass)

Later upload them to our current environment on Colaboratory by clicking View > Table of Contents > Files then Upload.  
(We should not load these files from url)

In [6]:
# Upon uploading our file, we will then load our first table from the CSV file as shown 
# We are going to use one of pandas function which is read_csv(). This function helps us to load data from csv files into python. It takes a several arguments/ parameters but we are going to use only a few for now. 
# The first arugument is the path of the csv file. This tells the function where your csv is located and the name of the csv. It can also be a url.
# The second argument, index_col, tells pandas to use the row indexes as the row labels.
with open('Interpol.csv','r') as f:
    Interpol = pd.read_csv(f, index_col=0, encoding='utf-8')

In [7]:
# We will then drop existing tables similar to the one that we will work with
# in our current sqlite environment. Then push our Interpol data into a new 
# table within our current SQLite Database 
#

%sql PERSIST Interpol;

 * sqlite://

'Persisted interpol'

In [102]:
# Previewing our Interpol table
#
%%sql
SELECT * FROM Interpol LIMIT 5;

 * sqlite://
Done.

[('Albania', 3, 3, 0, 'Europe', 'http://www.crwflags.com/fotw/images/a/al.gif'),
 ('Angola', 0, 0, 1, 'Northern Africa', 'http://www.crwflags.com/fotw/images/a/ao.gif'),
 ('Argentina', 2, 2, 1, 'South America', 'http://www.crwflags.com/fotw/images/a/ar.gif'),
 ('Australia', 1, 1, 2, 'Oceania', 'http://www.crwflags.com/fotw/images/a/au.gif'),
 ('Austria', 1, 1, 0, 'Europe', 'http://www.crwflags.com/fotw/images/a/at.gif')]

### <font color="green">1.2 Challenges</font>

In [31]:
# Challenge 1
# Let's load our Startups.csv file. 
# Feel free to copy paste the code above and make the necessary modifications
# 
with open('Startups.csv','r') as f:
  Startups = pd.read_csv(f, index_col=0, encoding='utf-8')

In [ ]:
#Deleting pre-existing table name Startups
%sql PERSIST Startups;

In [50]:
#Ill now preview the start up data set
%%sql
SELECT * FROM Startups  LIMIT 5

 * sqlite://
Done.

[('Curebit', 'Operating', 2010.0, 'San Francisco - California - USA', 'Talkable is a social referral platform for online stories and subscriptions.', 'E-Commerce, Analytics, Internet, Marketing, Social Media', 'Allan Grant, Dominic Coryell, Jeff Yee, Nori Yoshida', 2011, 'Winter', '500 Startups, Dharmesh Shah, Alex Lloyd, Auren Hoffman, Gordon Tucker, Stage One Capital, reinmkr inc., Karl Jacob, Y Combinator', '$1200000, undisclosed amount', '290 Division St, #405, San Francisco, California, USA', 'San Francisco', 'California', 'USA', 'http://a5.images.crunchbase.com/image/upload/c_pad,h_98,w_98/v1407434890/sf19b2lsipbo6fazmjzq.png', 'http://www.seed-db.com/companies/view?companyid=102020', 'http://www.crunchbase.com/organization/curebit', 'https://www.talkable.com'),
 ('Goldbely', 'Operating', None, 'San Francisco - California - USA', "Goldbely is an e-commerce site for buying and discovering America's best handmade gourmet food & gifts.", 'Social, E-Commerce', 'Joe Ariel, Joel Gillman, Trevor Stow, Vanessa Torrivilla', 2013, 'Winter', '500 Startups, Funders Club, Dave McClure, Tim Draper, Intel Capital, ACE & Company, Y Combinator', '$3,000,000', '1 Bluxome Street, San Francisco, California, USA', 'San Francisco', 'California', 'USA', 'http://a3.images.crunchbase.com/image/upload/c_pad,h_98,w_98/v1397180367/99717257bb2a360419f75b586503af93.png', 'http://www.seed-db.com/companies/view?companyid=729001', 'http://www.crunchbase.com/organization/goldbely', 'http://www.goldbely.com'),
 ('theDailyMuse', 'Operating', 2011.0, 'New York City - New York - USA', 'The Daily Muse is a job search platform offering multimedia profiles of various companies that are hiring people.', None, 'Alex Cavoulacos, Kathryn Minshew, Melissa McCreery', 2012, 'Winter', '500 Startups, Great Oaks Venture Capital, Great Oaks Venture Capital, Thomas D. Lehrman, Adam Quinton, Y Combinator', '$2800000, $2100000, $1200000, $1200000', '33 WEST 26TH STREET, #2, New York, New York, USA', 'New York City', 'New York', 'USA', 'http://a5.images.crunchbase.com/image/upload/c_pad,h_98,w_98/v1398232938/ffck9mcohrtktbkj3oie.jpg', 'http://www.seed-db.com/companies/view?companyid=96040', 'http://www.crunchbase.com/organization/the-daily-muse', 'http://www.thedailymuse.com'),
 ('Zencoder', 'Exited', None, 'San Francisco - California - USA', 'Zencoder is web-based video encoding SaaS designed to convert any video into web and mobile-compatible formats in real-time.', 'SaaS, Cloud Computing, Audio, Web Development, Data, Security, Video, Software', 'Brandon Arbini, Jon Dahl, Steve Heffernan', 2010, 'Winter', '500 Startups, Matt Cutts, Ignition Partners, James Lindenbaum, Orion Henry, Neil McClements, Wolfgang Buehler, Justin Yoshimura, Mike Bollinger, Adam Wiggins, SV Angel, Founder Collective, Robert Weber, Lowercase Capital, Andreessen Horowitz, Y Combinator', '$2000000, undisclosed amount', 'San Francisco, CA, 94103, USA', 'San Francisco', 'California', 'USA', 'http://a1.images.crunchbase.com/image/upload/c_pad,h_98,w_98/v1397206653/62e91e3f1c95f92912be5bd26638ea60.png', 'http://www.seed-db.com/companies/view?companyid=98019', 'http://www.crunchbase.com/organization/zencoder', 'http://zencoder.com'),
 ('GinzaMetrics', 'Operating', None, 'San Francisco - California - USA', 'GinzaMetrics offers an SEO and content marketing platform that provides recommendations and competitor analytics to agencies and marketers.', 'Enterprises, E-Commerce, Analytics, SEO, Enterprise Software', 'Ray Grieselhuber', 2010, 'Summer', '500 Startups, 500 Startups, Venture51, Jeff Miller, SunBridge Global Ventures, Y Combinator', 'undisclosed amount, $1300000, $400000, $14000', '25 Taylor Street, San Francisco, CA, 94103, USA', 'San Francisco', 'California', 'USA', 'http://a2.images.crunchbase.com/image/upload/c_pad,h_98,w_98/v1397186693/0738a0a8a1cce45f209ec0b0cbc75627.png', 'http://www.seed-db.com/companies/view?companyid=103018', 'http://www.crunchbase.com/organization/ginzametrics', 'http://ginzametrics.com')]

In [19]:
# Challenge 2
# Let's load our Transactions.csv file below
# 
with open('Transactions.csv','r') as f:
  Transactions = pd.read_csv(f, index_col=0, encoding='utf-8')

In [ ]:
#Confirming the transactions data set
%%sql
SELECT * FROM Transactions  LIMIT 5;

In [24]:
# Challenge 3
# Let's load our Glass.csv file below
# 
with open('Glass.csv','r') as f:
    Glass = pd.read_csv(f, index_col=0, encoding='utf-8')

In [ ]:
#Ill drop existing tables similar to this one
%sql DROP TABLE if EXISTS Glass;
%sql PERSIST Glass;

In [ ]:
#Ill test the glass dataset
%%sql
SELECT * FROM Glass  LIMIT 5

## 1.3 Inserting data into a table

In [ ]:
# Example 1: Previewing our table 
# We will first preview the last 5 records in Interpol our table
# NB: We learn this in our last SQL Session i.e. Sorting
#
%%sql
SELECT * FROM Interpol LIMIT 5

In [ ]:
# Example 2: Inserting data
# Then we will insert new data into our table and noting the added record
# Country = Uganda
# National Fugitives = 1
# Wanted Fugitives = 1
# Possible Hosted Fugitives / Captured Fugitives = 0
# Region = Sub Saharan Africa
# Flag = https://www.crwflags.com/art/countries/uganda.gif
%%sql
INSERT INTO Interpol (Country, "National Fugitives", "Wanted Fugitives", "Possible Hosted Fugitives / Captured Fugitives", Region, Flag)
VALUES ('Uganda', '1', '1', '0', 'Sub Saharan Africa', 'https://www.crwflags.com/art/countries/uganda.gif');

SELECT * FROM Interpol;

In [ ]:
# Example 2: Previewing the first five records in the Startups.csv file
#
%%sql 
SELECT * FROM Startups LIMIT 5;

In [ ]:
# Example 2: Inserting data
# Then we will insert new data into our table and noting all the values of the added record
# We will add The follwoing
# Company = 'Glova'
# Satus = 'Operating'   
# 
%%sql
INSERT INTO Startups (Company, Satus)
VALUES ('Glova', 'Operating');

SELECT * FROM Startups;

In [ ]:
# Example 3
# Now Inserting a new record into the specific columns; Company, Mapping Location, Categories
# Company = "Moringa"
# Mapping Location = "Nairobi"
# Categories = "Education"
#
%%sql
INSERT INTO Startups (Company, "Mapping Location", Categories) 
VALUES ("Moringa", "Nairobi", "Education");

SELECT * FROM Startups;

### <font color="green">1.3 Challenges</font>

In [ ]:
# Challenge 1
# Insert a new record into the Interpol table with  
# Country = Tanzania
# National Fugitives = 3
# Wanted Fugitives = Null
# Possible Hosted Fugitives / Captured Fugitives = 2
# Region = Sub Saharan Africa
# Flag = https://www.crwflags.com/art/countries/tanzania.gif
# 
%%sql
INSERT INTO Interpol(Country, "National Fugitives", "Wanted Fugitives", "Possible Hosted Fugitives / Captured Fugitives", Region, Flag)
VALUES('Tanzania', '3', 'Null', '2', 'Sub Saharan Africa', 'https://www.crwflags.com/art/countries/tanzania.gif');
SELECT * FROM Interpol;

In [ ]:
# Challenge 2
# Insert any two records of your choosing into the Interpol table
# 
%%sql
INSERT INTO Interpol(Country, "National Fugitives")
VALUES('Tilted Towers', '100');
SELECT * FROM Interpol;

In [ ]:
# Challenge 3
# Insert any new record in the Startups table only have the following attributes 
# Company, Mapping Location, Categories
# 
%%sql
INSERT INTO Startups(Company, "Mapping Location", Categories)
VALUES('Fortnite','Kenya', 'Coding');
SELECT * FROM Startups;

## 1.4 Updating records in a table

In [ ]:
# Example 1
# Let's update Albania to 4 National Fugitives in the Interpol table.
# 
%%sql
UPDATE Interpol
SET "National Fugitives" = 4
WHERE Country = "Albania";
SELECT * FROM Interpol;

In [ ]:
# Example 2
# Let's update any transactions record that has ride_id = 5781 
# to 5782
#
%%sql
UPDATE Transactions
SET ride_id = 5782
WHERE ride_id = 5781;

SELECT * FROM Transactions;

In [90]:
# Example 3
# Let's update the transactions record with ride_id = 5778 to 
# have travel_from = 'Kisii' and car_type = 'shuttle'
#
%%sql
UPDATE Transactions
SET travel_from = 'Kisii', car_type = 'shuttle'
WHERE ride_id = 5778;

SELECT * FROM Transactions;

 * sqlite://
4 rows affected.
Done.

[(1442, '15A', None, 'UZUEHCBUSO', '17-10-17', '7:15', 'Migori', 'Nairobi', 'Bus', 49),
 (5437, '14A', None, 'TIHLBUSGTE', '19-11-17', '7:12', 'Migori', 'Nairobi', 'Bus', 49),
 (5710, '8B', None, 'EQX8Q5G19O', '26-11-17', '7:05', 'Keroka', 'Nairobi', 'Bus', 49),
 (5777, '19A', None, 'SGP18CL0ME', '27-11-17', '7:10', 'Homa Bay', 'Nairobi', 'Bus', 49),
 (5778, '11A', None, 'BM97HFRGL9', '27-11-17', '7:12', 'Kisii', 'Nairobi', 'shuttle', 49),
 (5777, '18B', None, 'B6PBDU30IZ', '27-11-17', '7:10', 'Homa Bay', 'Nairobi', 'Bus', 49),
 (5777, '14A', None, 'MZHGDGS6QZ', '27-11-17', '7:10', 'Homa Bay', 'Nairobi', 'Bus', 49),
 (5778, '25', None, 'MYVTYFNXDZ', '27-11-17', '7:12', 'Kisii', 'Nairobi', 'shuttle', 49),
 (5778, '21B', None, 'TE1WYK1NYE', '27-11-17', '7:12', 'Kisii', 'Nairobi', 'shuttle', 49),
 (5781, '22A', None, 'VGG7Q3MVJX', '27-11-17', '7:09', 'Homa Bay', 'Nairobi', 'Bus', 49),
 (5781, '18B', None, 'YJ7JFHOGKA', '27-11-17', '7:09', 'Homa Bay', 'Nairobi', 'Bus', 49),
 (5781, '17B', None, '4JQOSC881A', '27-11-17', '7:09', 'Homa Bay', 'Nairobi', 'Bus', 49),
 (5784, '1X', None, '3OPU23FHRB', '20-04-18', '5:10', 'Kisii', 'Nairobi', 'shuttle', 11),
 (5789, '1X', None, 'BPRX4UMFFN', '20-04-18', '9:50', 'Kisii', 'Nairobi', 'shuttle', 11),
 (5778, '3A', None, 'JDD4ZL64LP', '27-11-17', '7:12', 'Kisii', 'Nairobi', 'shuttle', 49),
 (5790, '1B', None, 'DC8ABRSXXK', '20-04-18', '7:06', 'Kisii', 'Nairobi', 'Bus', 49),
 (5791, '1', None, 'HGQURN0SZS', '20-04-18', '6:00', 'Kisii', 'Nairobi', 'shuttle', 11),
 (5792, '1', None, '8D9V8HK2FC', '20-04-18', '5:50', 'Kisii', 'Nairobi', 'shuttle', 11),
 (5793, '1', None, 'TTZQDYZHAB', '20-04-18', '10:58', 'Kisii', 'Nairobi', 'shuttle', 11),
 (5790, '4A', None, 'F8VBKYCXPL', '20-04-18', '7:06', 'Kisii', 'Nairobi', 'Bus', 49),
 (5794, '1', None, 'ETNVCDEZLR', '20-04-18', '6:50', 'Kisii', 'Nairobi', 'shuttle', 11)]

### <font color="green">1.4 Challenges</font>

In [91]:
# Challenge 1
# Update the transactions records with the 
# payment_method = none to Null
# 
%%sql
UPDATE Transactions
SET "payment_method" = Null
WHERE "payment_method" IS NONE;
SELECT * FROM Transactions;

 * sqlite://
(sqlite3.OperationalError) no such column: NONE
[SQL: UPDATE Transactions
SET "payment_method" = Null
WHERE "payment_method" IS NONE;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [ ]:
# Challenge 2
# Update the Interpol records with Wanted Fugitives	 = 2
# to National Fugitives = 2 
# 
%%sql
UPDATE Interpol
SET "National Fugitives" = 2
WHERE "Wanted Fugititves" = 2;
SELECT * FROM Interpol;

In [ ]:
# Challenge 3 
# Update the transactions records with car_type = "Bus" to 
# have car_type = "shuttle" and travel_to = "Nairobi Downtown"
# 
%%sql
UPDATE Transactions
SET car_type = "shuttle", travel_to = "Nairobi Downtown"
WHERE car_type = "Bus";
SELECT * FROM Transactions;

## 1.5 Updating with Conditions

In [ ]:
# Example 1
# As you have seen from the previous examples, we used the WHERE clause to specify
# where we would like to make our updates on the table.
# Now, how then would we do this for multiple records. Say, we wanted to update 
# records with Kisii to "Kisii Old Stage", we would do the following
#
%%sql 
UPDATE Transactions
SET travel_from = "Old Kisii"
WHERE travel_from = "Kisii";

SELECT * FROM Transactions;

In [ ]:
# Example 2
# We also need to be careful when updating records. If we omit the WHERE clause, ALL records will be updated!
# For example, running the code below will update our entire Wanted Fugitives 
# column with our new value as show in this example
# 
%%sql
UPDATE Interpol
SET "Wanted Fugitives"= 1; 

SELECT * FROM Interpol;

In [ ]:
# Example 2: Getting back our values.
# A way to get back our values in the Wanted Fugitives table
# is to read the table again. However, this will not consider any changes
# that we had made earlier on.
with open('Interpol.csv','r') as f:
    Interpol = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Interpol;
%sql PERSIST Interpol;
%sql SELECT * from Interpol;

In [ ]:
# Example 3
# We can update Glass records which have Fe > 2.5 to Type = 2 
# We first preview it below
#
OUR CODE GOES HERE

In [ ]:
# Example 3
# The perform the mentioned update
#
%%sql
UPDATE Glass
SET Type = 2
WHERE Fe > 0.2;

SELECT * FROM Glass;

### <font color="green">1.5 Challenges</font>

In [ ]:
# Challenge 1
# Let's update Angola with National Fugitives = 2, Wanted Fugitives = 2
# and 0 Possible Hosted Fugitives / Captured Fugitives
# 
%%sql
UPDATE Interpol
SET "National Fugitives" = 2, "Wanted Fugitives" = 2, "Possible Hosted Fugitives / Captured Fugitives" = 0
WHERE Country = "Angola";
SELECT *FROM Interpol;

In [ ]:
# Challenge 2
# Update Glass records with Na > 14 to have Type 3 
#
%%sql
UPDATE Glass
SET Type = 3
WHERE Na > 14;

SELECT * FROM Glass;

In [ ]:
# Challenge 3
# Update Treatment records with id > 41 to have treatment = "treated"
# 
%%sql
SELECT * FROM Startups
LIMIT 1

## 1.6 Updating using value from another column

In [ ]:
# Example 
# From our Interpol table, lets update National Fugitives = 0 to 
# have the values of its Wanted fugitives.
#
%%sql
UPDATE Interpol
set "National Fugitives" = Interpol."Wanted Fugitives"
where "National Fugitives" = 0;

SELECT * FROM Interpol;

### <font color="green">1.6 Challenges</font>

In [ ]:
# Challenge 
# From our Interpol table, we will need to update National Fugitives = 0 with
# National Fugitives the sum of Wanted Fugitives and Possible Hosted Fugitives / Captured Fugitives
#
%%sql
UPDATE Interpol
set "National Fugitives"="Wanted Fugitives"+"Possible Hosted Fugitives / Captured Fugitives"
WHERE "National Fugitives" = 0;
SELECT * FROM Interpol